# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Qinh\Documents\PSoC Creator\Workspace01\cy8c4025-34channel-touch.cydsn\cy8c4025-34channel-touch.cyprj
# Date: Fri, 25 Jul 2025 08:18:58 GMT
#set_units -time ns
create_clock -name {CapSense_ModClk(FFB)} -period 10625 -waveform {0 5312.5} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {UART_1_SCBCLK(FFB)} -period 375 -waveform {0 187.5} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {CapSense_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {UART_1_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 9 19} [list]


# Component constraints for C:\Users\Qinh\Documents\PSoC Creator\Workspace01\cy8c4025-34channel-touch.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Qinh\Documents\PSoC Creator\Workspace01\cy8c4025-34channel-touch.cydsn\cy8c4025-34channel-touch.cyprj
# Date: Fri, 25 Jul 2025 08:18:57 GMT
